<h1>Циклический алгоритм</h1>
<h2>Цикл с предусловием - While (пока)</h2>
<?php
$n=0;
while($n<10){
    echo $n;
    $n++;
};?>
<h2>Цикл с постусловием - do..while</h2>
<?php
$n=0;
do{
    echo $n;
    $n++;
}while($n<10);?>
<h2>Цикл с параметром - for(для)</h2> 
<?php for($i=0; $i<10;$i++){echo $i;}?>

<?php
for($i=0;$i<5;$i++){
    for($j=0;$j<10;$j++){
        echo 'Q';
    }
}?>
<h2>Break and continue</h2>
<p>break - Прерывает цикл и выходит за его пределы</p>
<p>continue - прерывает текущую итерацию и переходит к проверке условия</p>