<h1>Циклы</h1>
<h2>Задание 1</h2>
<p>Напиши программу, которая последовательно выводит на экран числа в геометрической прогрессии.

Стартовое значение, с которого должна начаться последовательность, записано в переменную startNumber.

Множитель записан в переменную multiplier.

Количество чисел записано в переменную quantity.</p>
<?php
$startNumber=5;
$multipler=2;
$quantity=3;
echo "Стартовое значение - 5<br>";
echo "Множитель - 2<br>";
echo "Количество чисел - 3<br> <br>";
for ($i=0;$i < $quantity;$i++){
    echo $startNumber . "; ";
    $startNumber *= $multipler;
}?>
<h2>Задание 2</h2>
<p>Напишите универсальную программу, которая вычисляет сумму чисел от 1 до n.

Число, до которого нужно складывать числа (включительно), указано в переменной lastNumber.

Найдите сумму всех чисел и сохраните результат в переменную sum.

Выведите ее на экран.</p>
<?php
$LastNumber=100;
$sum=1;
echo "Число, до которого нужно складывать числа (включительно) - ". $LastNumber."<br>";
for($i=1;$i<$LastNumber; $i++){
    $sum +=$i;
}
echo "Сумма чисел: ". $sum;?>

<h2>Задание 3</h2>
<p>Напишите универсальную программу, которая вычисляет сумму чисел от 1 до n.

Число, до которого нужно складывать числа (включительно), указано в переменной lastNumber.

Найдите сумму всех чисел и сохраните результат в переменную sum.

Выведите ее на экран.</p>
<?php
$LastNumber=10;
echo"Число, до которого идёт последовательность (включительно).$LastNumber";
$multiplicationResult=1;
for($i=1;$i<$LastNumber;$i++){
    if($i%2==0){
    $multiplicationResult *=$i;}
}; echo "Произведение всех целых чисел: " . $multiplicationResult;?>

<h2>Задание 4</h2>
<p>Начав тренировки, спортсмен в первый день пробежал 10 км.

Каждый день он увеличивал дневную норму на 10% нормы предыдущего дня. Какой суммарный путь пробежит спортсмен за n дней?</p>
<?php
$r=10;
$dailyNorm= 10;
$TotalDistance=0;
for($i=1;$i<$r;$i++){
    $TotalDistance +=$dailyNorm;
    $dailyNorm *= 1.10;
} 
echo "За $r дней спорсмен пробежит: ".round($TotalDistance,2) ."км";?>

<h2>Задание 5</h2>
<p>У гусей и кроликов вместе 64 лапы. Сколько может быть кроликов и гусей (указать все сочетания)?</p>
<?php
echo "Возможные сочетания живтоных:<br>";
for($g=0;$g<=16;$g++){
    for($r=0;$r<=16;$r++){
        if (($g*2+$r*4)==64){
            echo "Кроликов: $r,<br> Гусей: $g; <br><br>";
        }
    }
}



