<h1>Операции в php</h1>
<h2>Арифмитические операции</h2>
<p>+ - / * **</p>
<?php
$a=23**2;
echo $a;
?>
<h2>Инкремент и декремент</h2>
<?php
$b=2;
$b++;
$q=3;
$q--;
$c=$b++;
echo"b=$b,q=$q,c=$c";
?>
<h2>Операция со строками</h2>
<?php
$str1='Hello,';
$str2='PHP!';
$str3='Я учусь на '. 2 .' курсе';
echo $str1 . $str2,"<br>",$str3;
?>
<h2>Операция сравнения</h2>
<p>< > <= >= == === !==</p>
<?php
$s=4<5;
$a=4=='4';
$s1=4==='4';
echo "$s,$s1,$a";
?>
<h2>Логические операции</h2>
<p>Логическое И(and &&),логическое ИЛИ (|| or),логическое НЕ (!)</p>
<?php
$p=true && false; //false
$p1=true || false; //true
$p2=5<=7 && 4==5; //false
$p3=!$p2;//true
?>
<h2>Операции присваивания</h2>
<p>=</p>
<?php $o=$r=5;?>// o and r = 5
<p>+= _= *= **= /= .= %=</p>
<?php $l=42; $l+=10;$string= 'Hello, '; $string.='word!';
echo $l;?>
<h2>Приоритетные Операции</h2>
<p>**</p>
<p> ++ --</p>
<p>!</p>
<p>* / %</p>
<p>+ -</p>
<p> < > <= >=</p>
<p>== != === !==</p>
<p>&&</p>
<p>||</p>
<p>+= -= ...</p>

