<h1>Практическая по теме:Условия.</h1>
<h2>Задание 1</h2>
<p>Ввести с клавиатуры два числа a и b. Если a < b вывести на экран сумму a+b, иначе вывести на экран произведение a*b</p>
<?php
$a=14;
$b=2;
echo "a=14<br>";
echo "b=2<br>";
if ($a>$b){
    echo "Сумма а+b=".($a+$b);
}else{
    echo "Произведение a*b= ".($a*$b);
}
?>

<h2>Задание 2</h2>
<p>Даны два угла треугольника (в градусах). Определить, существует ли такой треугольник, и если да, то будет ли он прямоугольным.</p>
<?php
$angle1=90;
$angle2=15;
echo "Угол 1=90<br>";
echo "Угол 2=15<br>";
if ($angle1>0 && $angle2>0 && ($angle1+$angle2)<180){
    echo "Треугольник сущесвует<br>";
}else{
    echo "Он не является треугольником<br>";
};
$angle3=180-($angle1+$angle2);
if ($angle1=90||$angle2=90||$angle3=90){
 echo ":Треугольник является прямоугольным";
}else{
    echo":Треугольник не прямогугольный";
}?>
<h2>Задание 3</h2>
<p>Напиши программу, которая будет определять возрастную группу котов по возрасту.
    Возраст записан в переменную age.

Проверяй возраст и записывай возрастную группу в виде строки в переменную ageGroup.

Если возраст до года включительно, то возрастная группа называется 'Котята'.

Если возраст от года (не включая это значение) до трёх лет включительно — 'Молодые коты'.

Если возраст от трёх лет (не включая это значение) до семи (включительно) — 'Коты средних лет'.

А если возраст от семи лет (не включая это значение) и больше — 'Почтенные коты'.
</p>
<?php
$age=4;
$ageGroup="";
echo "Возвраст кота $age<br><br>";
if ($age<=1){
    echo "Котята";
}elseif($age>1 && $age<=3){
    echo "Молодые котята";
}elseif($age>3 && $age<=7){
    echo "Кот средних лет";
}elseif($age>7){
    echo "Почтенный кот";
}?>

<h2>Задание 4</h2>
<p>Даны три стороны треугольника a, b, с (ввести с клавиатуры). Вывести на экран сообщение о том, существует ли такой треульник.</p>
<?php
$a=12;
$b=10;
$c=5;
echo "Первая сторона - 12<br>";
echo "Вторая сторона - 10<br>";
echo "Третья сторона- 5<br><br>";
if ($a+$b>$c && $c+$b=$a && $a+$c=$b){
    echo "Треугольник с такими сторонами существует<br>";
}else{
    echo "Такой треугольник не может сущесвтовать<br>";
}?>  
<h2>Задание 5</h2>
<p>Определить, является ли заданный год N високосным. Год високосный, если N не кратно 100 и число, составленное его двумя последними цифрами, кратно четырем. если N кратно 100, то год високосный лишь при N, кратном 400.</p>
<?php
$N=2000;
echo "$N год<br>";
if (($N%100!==0 && $N%4==0 )|| $N%400==0){
    echo "Год высокосный ";
}else{
    echo "Год не высокосный";
}?>
<h2>Задание 6</h2>
<p>Составить программу, которая проверяла бы, не приводит

ли суммирование двух целых чисел А и В к переполнению (т.е. к

результату большему чем 32767). Если будет переполнение, то сообщить об этом, иначе вывести сумму этих чисел.</p>
<?php
$A=10000;
$B=23400;
echo "Число А - $A<br>";
echo "Число B - $B<br>";
if ($A+$B<=32767){
    echo "Сумма А и B" .($A+$B);
}else{
    echo "Произошло переполнение";
}?>
<h2>Задание 7</h2>
<p>Заданы размеры А, В прямоугольного отверстия и размеры х, у, z кирпича. Определить, пройдет ли кирпич через отверстие.</p>
<?php
$A=12;
$B=10;
$x=10;
$y=6;
$z=7;
echo "Размер А - $A<br>";
echo "Размер B - $B<br><br>";
echo "Размеры кирпича:<br>";
echo "Размер z - $z<br>";
echo "Размер y - $y<br>";
echo "Размер x - $x<br><br>";
if(($A>$x && $B>$y)||($A>$y && $A>$z)||($A>$z && $B>$y) ||($A>$y && $B>$x)||($A>$z && $B>$x)||($A>$x && $B>$z)){
    echo"Кирпич проходит через прямоугольное отверстие";
}else{
    echo"Кирпич не проходит через прямоугольное отверстие";
}?>

<h2>Задание 8</h2> 
<p>Вычислить число и месяц в невисокосном году по номеру дня.</p>
<?php
$daynumber=301;
$months=[
    1=>"Январь",2=>"Февраль",3=>"Март",4=>"Апрель",5=>"Май",6=>"Июнь",
    7=>"Июля",8=>"Августа",9=>"Сентябрь",10=>"Октябрь",11=>"Ноябрь",12=>"Декабрь"
    ];
$daymonth=[1=>31,2=>28,3=>31,4=>30,5=>31,6=>30,7=>31,8=>31,9=>30,10=>31,11=>30,12=>31,];
$m=1;
$currentday=$daynumber;
while($currentday>$daymonth[$m]){
    $currentday -= $daymonth[$m];
    $m++;
}
echo "$daynumber День - это $currentday " .$months[$m];
?>
<h2>Задание 9</h2>
<p>Выяснить, делится ли введенное число на 4 и 6.</p>
<?php
$d=36;
$s=6;
$s1=4;
echo "Введенное число: $d<br><br>";
if($d%6===0 && $d%4==0){
    echo "Число $d делится на 4 и 6.<br>Получаемые ответы при деления на 6=".($d/$s).",при деление на 4=".($d/$s1)."." ;
}else {
    echo "Число не делиться на 4 и 6";
} 
?>
<h2>Задание 10</h2>
<p> Даны координаты точки (x, y) и радиус окружности r. Проверьте, лежит ли точка внутри круга (включая границу).</p>
<?php
$X=10;
$y=5;
$r=6;
echo "Координата х - $x<br>";
echo "Координата y - $y<br><br>";
if($x<=$r && $y<=$r){
    echo "Точка поподает в окружность с r=6";
}else{
 echo "Точка не попадает в окружность с r=6";
}
?>

