<h1>Тернарный оператор</h1>
<h2>Задние 1</h2>
<p> Ввести с клавиатуры два числа a и b. Если a < b вывести на экран сумму a+b, иначе вывести на экран произведение a*b</p>
<?php
$a=4;
$b=5;
$wq=$a<$b ? ($a + $b) : ($a * $b);
echo $wq;?>

<h2>Задание 2</h2>
<p>Дано число n. Выведите "чётное", если оно делится на 2 без остатка, иначе — "нечётное".</p>
<?php
$n=3;
$w=2;
$res= $n/2==0 ? "Четное":"Нечетное";
echo $res;?>
<h2>Задание 3</h2>
<p>Дана сумма покупки sum. Если сумма больше 1000, скидка 10%, иначе — 5%. Вычислите итоговую стоимость.</p>
<?php
$sum=1001;
$aw=$sum<1000 ? "Скидка при sum - $sum только 10%":"Скидка при sum - $sum будет 15% ";
echo $aw;?>
<h2>Задние 4</h2>
<p>Даны три стороны треугольника a, b, с (ввести с клавиатуры). Вывести на экран сообщение о том, существует ли такой треульник.</p>
<?php
$a=3;
$b=3;
$c=5;
$ew=$a+$b>$c||$a+$c>$a||$a+$c>$b?"Треугольник сущесвует":"Треугольника не сущесвует";
echo $ew;?>
<h2>Задание 5</h2>
<p>Напиши программу, которая будет определять возрастную группу котов по возрасту.
    Возраст записан в переменную age.

Проверяй возраст и записывай возрастную группу в виде строки в переменную ageGroup.

Если возраст до года включительно, то возрастная группа называется 'Котята'.

Если возраст от года (не включая это значение) до трёх лет включительно — 'Молодые коты'.

Если возраст от трёх лет (не включая это значение) до семи (включительно) — 'Коты средних лет'.

А если возраст от семи лет (не включая это значение) и больше — 'Почтенные коты'.
</p>
<?php
$age=5;
$ageGroup = ($age <= 1) ? "Котята": (($age < 3) ? "Молодые коты": (($age <= 7) ? "Коты средних лет": "Почтенные коты"));
echo $ageGroup;?>
<h2>Задание 6</h2>
<p>Даны два угла треугольника (в градусах). Определить, существует ли такой треугольник, и если да, то будет ли он прямоугольным.</p>
<?php
$angle1=90;
$angle2=80;
if ($angle1>180 and $angle2>180 || $angle1+$angle2>180) {
    echo "не существует";
} else {
    echo ($angle1 == 90 || $angle2 == 90)? "существует, прямоугольный" : "существует, не прямоугольный";}?>
