<h2>Задание 1</h2>
<p>Для каждой введенной цифры (0 — 9) вывести соответствующее ей название на английском языке (0 — zero, 1 — one,

2 — two,... ).</p>
<?php
$q=9;
$res=match((int)$q){
    0=>'Zero',
    1=>'One',
    2=>'Two',
    3=>'Tree',
    4=>'Four',
    5=>'Five',
    6=>'Six',
    7=>'Seven',
    8=>'Eight',
    9=>'Nine',
};echo "$res";?>
<h2>Задание 2</h2>
<p>Написать программу, которая по введенному числу от 1 до

12 (номеру месяца) выдает все приходящиеся на этот месяц праздничные дни (например, если введено число 1, то должно получиться 1 января — Новый год, 7 января — Рождество</p>
<?php
$month=11;
$rew=match((int)$month){
    1=>'',
    2
    3
    4
    5
    6
    7
    8
    9
    10
    11
    12=>''
};