<h2>Задание 1</h2>
<p>Для каждой введенной цифры (0 — 9) вывести соответствующее ей название на английском языке (0 — zero, 1 — one,

2 — two,... ).</p>
<?php
$q=9;
$res=match((int)$q){
    0=>'Zero',
    1=>'One',
    2=>'Two',
    3=>'Tree',
    4=>'Four',
    5=>'Five',
    6=>'Six',
    7=>'Seven',
    8=>'Eight',
    9=>'Nine',
};echo "$res";?>
<h2>Задание 2</h2>
<p>Написать программу, которая по введенному числу от 1 до

12 (номеру месяца) выдает все приходящиеся на этот месяц праздничные дни (например, если введено число 1, то должно получиться 1 января — Новый год, 7 января — Рождество</p>
<?php
$month=11;
$rew=match((int)$month){
    1=>'1 января — Новый год, Всемирный день мира.
7 января — Рождество Христово. 
11 января — День «спасибо». 
14 января — Старый Новый год. 
17 января — День детских изобретений. 
25 января — Татьянин день (День российского студенчества). 
26 января — Международный день таможенника. 
28 января — Международный день защиты персональных данных. 
31 января — Международный день ювелира.',
    2=>'2 февраля — День сурка. 
6 февраля — Международный день бармена. 
7 февраля — День российского бизнес-образования. 
8 февраля — День российской науки. 
9 февраля — Международный день стоматолога, День работника гражданской авиации. 
10 февраля — День дипломатического работника. 
14 февраля — День святого Валентина, Международный день дарения книг. 
23 февраля — День защитника Отечества. 
26 февраля — Всемирный день неторопливости. 
28 февраля — Всемирный день портного.',
    3=>'1 марта — День кошек
8 марта — Международный женский день
14 марта — День числа π
20 марта — Международный день счастья
21 марта — Всемирный день поэзии
27 марта — Всемирный день театра',
    4=>'1 апреля — День смеха
7 апреля — Всемирный день здоровья
12 апреля — День космонавтики
22 апреля — День Земли',
    5=>'1 мая — Праздник Весны и Труда
9 мая — День Победы
15 мая — Международный день семьи
18 мая — Международный день музеев
24 мая — День славянской письменности и культуры',
    6=>'1 июня — День защиты детей
5 июня — Всемирный день окружающей среды
6 июня — Пушкинский день (День русского языка)
12 июня — День России
27 июня — День молодёжи',
    7=>'8 июля — День семьи, любви и верности
20 июля — Международный день шахмат
30 июля — Международный день дружбы',
    8=>'8 августа — Всемирный день кошек
22 августа — День Государственного флага РФ
27 августа — День российского кино',
    9=>'1 сентября — День знаний
8 сентября — Международный день грамотности
21 сентября — Международный день мира
27 сентября — Всемирный день туризма',
    10=>'1 октября — Международный день пожилых людей
4 октября — Всемирный день животных
5 октября — День учителя
14 октября — Покров Пресвятой Богородицы
31 октября — Хэллоуин',
    11=>'4 ноября — День народного единства
10 ноября — День полиции
16 ноября — Международный день толерантности
21 ноября — День бухгалтера
Последнее воскресенье ноября — День матери',
    12=>'3 декабря — Международный день инвалидов
10 декабря — День прав человека
12 декабря — День Конституции РФ
31 декабря — Канун Нового года'
};?>
<h2>Задание 3</h2>
<p>Написать программу, позволяющую по последней цифре числа

определить последнюю цифру его квадрата.</p>