<h2>Задание 1</h2>
<p>Для каждой введенной цифры (0 — 9) вывести соответствующее ей название на английском языке (0 — zero, 1 — one,

2 — two,... ).</p>
<?php
$q=9;
$res=match((int)$q){
    0=>'Zero',
    1=>'One',
    2=>'Two',
    3=>'Tree',
    4=>'Four',
    5=>'Five',
    6=>'Six',
    7=>'Seven',
    8=>'Eight',
    9=>'Nine',
};echo "$res";?>
<h2>Задание 2</h2>
<p>Написать программу, которая по введенному числу от 1 до

12 (номеру месяца) выдает все приходящиеся на этот месяц праздничные дни (например, если введено число 1, то должно получиться 1 января — Новый год, 7 января — Рождество</p>
<?php
$month=11;
$rew=match((int)$month){
    1=>'1 января — Новый год, Всемирный день мира.<br>
7 января — Рождество Христово. <br>
11 января — День «спасибо». <br>
14 января — Старый Новый год. <br>
17 января — День детских изобретений. <br>
25 января — Татьянин день (День российского студенчества).<br> 
26 января — Международный день таможенника. <br>
28 января — Международный день защиты персональных данных.<br> 
31 января — Международный день ювелира.',
    2=>'2 февраля — День сурка. <br>
6 февраля — Международный день бармена. <br>
7 февраля — День российского бизнес-образования.<br> 
8 февраля — День российской науки. <br>
9 февраля — Международный день стоматолога, День работника гражданской авиации.<br> 
10 февраля — День дипломатического работника. <br>
14 февраля — День святого Валентина, Международный день дарения книг.<br> 
23 февраля — День защитника Отечества. <br>
26 февраля — Всемирный день неторопливости.<br> 
28 февраля — Всемирный день портного.',
    3=>'1 марта — День кошек<br>
8 марта — Международный женский день<br>
14 марта — День числа π<br>
20 марта — Международный день счастья<br>
21 марта — Всемирный день поэзии<br>
27 марта — Всемирный день театра',
    4=>'1 апреля — День смеха<br>
7 апреля — Всемирный день здоровья<br>
12 апреля — День космонавтики<br>
22 апреля — День Земли',
    5=>'1 мая — Праздник Весны и Труда
9 мая — День Победы<br>
15 мая — Международный день семьи<br>
18 мая — Международный день музеев<br>
24 мая — День славянской письменности и культуры',
    6=>'1 июня — День защиты детей<br>
5 июня — Всемирный день окружающей среды<br>
6 июня — Пушкинский день (День русского языка)<br>
12 июня — День России<br>
27 июня — День молодёжи',
    7=>'8 июля — День семьи, любви и верности<br>
20 июля — Международный день шахмат<br>
30 июля — Международный день дружбы<br>',
    8=>'8 августа — Всемирный день кошек<br>
22 августа — День Государственного флага РФ<br>
27 августа — День российского кино',
    9=>'1 сентября — День знаний<br>
8 сентября — Международный день грамотности<br>
21 сентября — Международный день мира<br>
27 сентября — Всемирный день туризма',
    10=>'1 октября — Международный день пожилых людей<br>
4 октября — Всемирный день животных<br>
5 октября — День учителя<br>
14 октября — Покров Пресвятой Богородицы<br>
31 октября — Хэллоуин',
    11=>"4 ноября — День народного единства <br>
10 ноября — День полиции <br>
16 ноября — Международный день толерантности <br>
21 ноября — День бухгалтера <br>
Последнее воскресенье ноября — День матери<br>",
    12=>"3 декабря — Международный день инвалидов
10 декабря — День прав человека
12 декабря — День Конституции РФ
31 декабря — Канун Нового года"
};
echo $rew?>
<h2>Задание 3</h2>
<p>Написать программу, позволяющую по последней цифре числа

определить последнюю цифру его квадрата.</p>